NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/verificationAndValidation/turbulenceModels/planeChannel/setups.orig/common/system/sampleG
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type                sets;
libs                (sampling);
interpolationScheme cellPoint;
setFormat           raw;
executeControl      writeTime;
writeControl        writeTime;
fields
(
    productionRate
);

sets
(
    y
    {
        type    midPoint;
        axis    y;
        start   (0.5 0 0.5);
        end     (0.5 1 0.5);
    }
);


// ************************************************************************* //
